** The Function Invocation Pattern

   When function is not property of an object, then it is invoked as a function. In this case,
   this is bound to the global object

   A consequence of this error in the language means a method cannot employ an inner 
   function to help it do its work because the inner function does not share the method's
   access to the object as its `this` is bound to the wrong value.

   Workaround: If the method defines a variable and assigns it the value of this,
   the inner function will have access to this through that variable. By convention,
   we name that variable `that`

   #+BEGIN_SRC js
     function add(a,b) { return a + b } 

     var myObject = {value: 1}

     myObject.double = function(){
         var that = this
         var helper = function() {
             console.log("This from inner function: " + this)
             that.value = add(that.value, that.value)
         }
         helper()
     }

     myObject.double()
     console.log(myObject)
   #+END_SRC

   #+RESULTS:
   : This from inner function: [object global]
   : { value: 2, double: [Function] }
   : undefined

** The Constructor Invocation Pattern
   Prototypal inheritance language means objects can inherit properties directly from other
   objects

   If a function is invoked with the `new` prefix, then a new object will be created with
   a hidden link to the value of the function's prototype member, and this will be bound
   to that new object. 

   The `new` prefix also changes the behavior of the return statement

   #+BEGIN_SRC js

     // Create a constructor function called Quo.
     // It makes an object with a status property.
     var Quo = function (string) {
         this.status = string;
     };
     // Give all instances of Quo a public method
     // called get_status.
     Quo.prototype.get_status = function ( ) {
         return this.status;
     };
     // Make an instance of Quo.
     var myQuo = new Quo("confused");
     console.log(myQuo.get_status( )); // confused
             
   #+END_SRC

   #+RESULTS:
   : confused
   : undefined

   Functions intended to be used with the new prefix are called constructors. By convention,
   they are kept in variables with capitalized names

** The Apply Invocation Pattern
   Since JS is a functional object-orientated language, functions can have methods

   apply method
   - Lets us construct an array of arguments to use to invoke a function.
     Also lets use choose the value of `this`
   - 2 parameters, the first value that should be bound to `this`, the second
     is the array of parameters

   #+BEGIN_SRC js

     var Quo = function (string) {
         this.status = string;
     };

     Quo.prototype.get_status = function ( ) {
         return this.status;
     };

     function add(a,b) { return a + b }

     var array = [3,4]
     var sum = add.apply(null, array) // sum is 7

     console.log(sum)
         
     // Make an object with a status member
     var statusObject = {
         status: 'A-OK'
     }

     // statusObject does not inherit from Quo.prototype,  
     // but we can invoke the get_status method on         
     // statusObject even though statusObject does not have
     // a get_status method.                               
     var status = Quo.prototype.get_status.apply(statusObject);
     console.log(status)
   #+END_SRC

   #+RESULTS:
   : 7
   : A-OK
   : undefined

** Arguments
   A bonus parameter that is available to function when they are invoked is arguments array.
   function has access to all arguments supplied with invocation, including excess args

   #+BEGIN_SRC js
     var sum = function() {
         var sum = 0
         for (let i = 0; i < arguments.length; ++i)
             sum+=arguments[i]
         return sum;
     }
     console.log(sum(1,2,3,4,5,6,7,8,9,10))
   #+END_SRC

   #+RESULTS:
   : 55
   : undefined

   Due to design error, arguments is not really an array. It is array-like object
   which has length property but lacks all array methods.

** Augmenting Types
   Adding a method to Object.prototype makes that method available to all objects. This
   also workds for functions, arrays, strings, numbers, regular expressions, and booleans.

   For example, by augmenting Function.prototype, we can make method available to all
   functions:

   #+BEGIN_SRC js
     Function.prototype.method = function(name, func) {
         this.prototype[name] = func
         return this
     }

     Number.method('integer', function() {
         return Math[this,0?'ceil':'floor'](this)
     })

     console.log((-10/3).integer())
   #+END_SRC

   #+RESULTS:
   : -4
   : undefined

** Scope
   JS does not have block scope, even though the syntax looks like it does rather function
   scope.

   note: let allows block scoping

   Function scope means that the parameters and variables defined in a function are visible
   anywhere in the function, but not necessarily mean a value is assigned to it.

   #+BEGIN_SRC js
     function t(){
         console.log(a) // Will not error out because it 'sees' the variable a

         var a = "Hello" 

         console.log(a)
     }
     t()
   #+END_SRC

   #+RESULTS:
   : undefined
   : Hello
   : undefined

** Closure
   With exception to `this` and `arguments`, inner functions get access to the parameters
   and variables of the function they are defined within.

   Closure is interesting for when the inner function has a longer lifetime than its outer
   function.

   We initialize myObject to a function that returns an object literal

   #+BEGIN_SRC js
     var myObject = function() {
         var value = 0;
         return {
             increment: function (inc) {
                 value+= typeof inc === 'number' ? inc : 1;
             },
             getValue : function() {
                 return value;
             }
         }
     }()
     myObject.increment(5)
     console.log(myObject.getValue())
   #+END_SRC

   #+RESULTS:
   : 5
   : undefined

** Module
   We can use functions and closure to make modules. A module is a function or object that
   presents an interface but that hides its states and implementation. 

   Here we avoid the use of global to store entities, and avoid runtime costs of evaluating
   literals everytime the function is invoked.

   #+BEGIN_SRC js
      String.prototype.deentityify = function() {
          var that = this
          // The entity table. It maps entity names to characters
          var entity = {
              quot: '"',
              lt: '<',
              gt: '>'
          }
          
          return function() {
              // This is the deentityify method. It calls the string
              // replace method, looking for substrings that start  
              // with '&' and end with ';'. If the characters in    
              // between are in the entity table, then replace the  
              // entity with the character from the table. It uses  
              // a regular expression (Chapter 7).                  
              return that.replace(/&([^&;]+);/g,
                                  function (a, b) {
                                      var r = entity[b];
                                      return typeof r === 'string' ? r : a;
                                  }
                                 )
          }()
      }
     console.log("&lt;&quot;&gt;".deentityify());
   #+END_SRC

   #+RESULTS:
   : <">
   : undefined

** Memoization

   #+BEGIN_SRC js
     var memoizer = function (memo, formula) {
         var recur = function (n) {
             var result = memo[n]
             if (typeof result !== 'number'){
                 result = formula(recur, n)
                 memo[n] = result
             }
             return result
         }
         return recur
     }

     var fibonacci = memoizer([0,1], function (recur, n) {
         return recur(n-1) + recur(n-2)
     })

     var factorial = memoizer([1,1], function (recur, n) {
         return n*recur(n-1)
     })

     console.log(fibonacci(10)) 
     console.log(factorial(10)) 
                  
   #+END_SRC

   #+RESULTS:
   : 55
   : 3628800
   : undefined

